---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RoutingCondition Properties
RoutingCondition Class See Also Send Feedback
---

The RoutingCondition type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Diameter | The diameter of the segment or fitting specified for the routing condition. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RoutingCondition Class

Autodesk.Revit.DB Namespace